[
    {
        "id": "SUKHACBIETGIUAGIITVAGITHUBRXTDDM100174165266441190520",
        "makeCode": "RXTDDM",
        "view": true,
        "date": "18102022",
        "title": "Sự Khác Biệt Giữa Git và GitHub",
        "createdBy": "Van Thinh Tran",
        "description": "#### Sự Khác Biệt Giữa GIit và GitHub\n\n| Git | GitHub |\n| ------ | ------ |\n|  Git là một phần mềm      |     Github là một dịch vụ         |\n|  Git là một công cụ dòng lệnh    |  Github là một giao diện người dùng đồ họa         |\n|       Git được phát hành lần đầu tiên vào năm 2005        |     Github được ra mắt vào năm 2008         |\n|        Git có cấu hình công cụ bên ngoài tối thiểu       |    Github có một thị trường đang hoạt động để tích hợp công cụ          |\n|  Git không có tính năng quản lý người dùng             |      Github được tích hợp tính năng quản lý người dùng        |\n|    Git tập trung vào kiểm soát phiên bản và chia sẻ mã           |      Github tập trung vào lưu trữ mã nguồn tập trung        |\n|          Git được cài đặt cục bộ trên hệ thống     |    Github được lưu trữ trên web          |\n|       Git được duy trì bởi linux        |       Github được duy trì bởi Microsoft       |",
        "createrID": "100174165266441190520",
        "path": "SUKHACBIETGIUAGIITVAGITHUBRXTDDM100174165266441190520",
        "PhoToCreater": "https://lh3.googleusercontent.com/a/ALm5wu3K3dg5RMuckvPuAzGHoV3lKz_a_bwhpkhU-1Ww=s96-c"
    },
    {
        "id": "DIACHIIP,CHIASUBNETRXAMCY117140301807267739210",
        "description": "### 1. Địa chỉ IP\n*Địa chỉ IP là địa chỉ logic được sử dụng trong giao thức IP của lớp Internet thuộc mô hình TCP/IP (tương ứng với lớp thứ 3 – lớp network của mô hình OSI). Mục này trình bày các điểm chính cần ghi nhớ về địa chỉ IP.*\n\n### 2.Cấu trúc địa chỉ IP\n\n*Địa chỉ IP gồm 32 bit nhị phân, chia thành 4 cụm 8 bit (gọi là các octet). Các octet được biểu diễn dưới dạng thập phân và được ngăn cách nhau bằng các dấu chấm.\n\nĐịa chỉ IP được chia thành hai phần: phần mạng (network) và phần host.* \n\n![](https://media-exp1.licdn.com/dms/image/C5612AQHFr8XS5-ewdQ/article-inline_image-shrink_1000_1488/0/1628756279737?e=1671062400&v=beta&t=7bEYlTdpXi1TGWgSTZDdemMW69N0ETBMgeYJF2ffG10)\n\n\n> Việc đặt địa chỉ IP phải tuân theo các quy tắc sau:\n\n> Các bit phần mạng không được phép đồng thời bằng 0.\n>>VD: địa chỉ 0.0.0.1 với phần mạng là 0.0.0 và phần host là 1 là không hợp lệ.\n\n>Nếu các bit phần host đồng thời bằng 0, ta có một địa chỉ mạng.\n>>VD: địa chỉ 192.168.1.1 là một địa chỉ có thể gán cho host nhưng địa chỉ 192.168.1.0 là một địa chỉ mạng, không thể gán cho host được.\n\n>Nếu các bit phần host đồng thời bằng 1, ta có một địa chỉ quảng bá (broadcast).\n>> VD: địa chỉ 192.168.1.255 là một địa chỉ broadcast cho mạng 192.168.1.0\n \n\n### 3. Các lớp địa chỉ IP\n\nCác lớp địa chỉ IP có thể sử dụng để đặt cho các host là các lớp A, B, C.\nĐể thuận tiện cho việc nhận diện một địa chỉ IP thuộc lớp nào, ta quan sát octet đầu của địa chỉ, nếu octet này có giá trị:\n\n1 => 126:        địa chỉ lớp A.\n\n128 => 191:    địa chỉ lớp B.\n\n192 => 223:    địa chỉ lớp C.\n\n224 => 239:    địa chỉ lớp D.\n\n240 => 255:    địa chỉ lớp E.\n\n\n### 4. Địa chỉ Private và Public:\n\n\n*Địa chỉ IP được phân thành hai loại: private và public.*\n\n*Private: chỉ được sử dụng trong mạng nội bộ (mạng LAN), không được định tuyến trên môi trường Internet. Có thể được sử dụng lặp đi lặp lại trong các mạng LAN khác nhau.\nPublic: là địa chỉ IP sử dụng cho các gói tin đi trên môi trường Internet, được định tuyến trên môi trường Internet, không sử dụng trong mạng LAN. Địa chỉ public phải là duy nhất cho mỗi host tham gia vào Internet.*\n\nDải địa chỉ private (được quy định trong RFC 1918):\n\n> Lớp A: 10.x.x.x\n\n> Lớp B: 172.16.x.x -> 172.31.x.x\n\n> Lớp C: 192.168.x.x\n\nKỹ thuật NAT (Network Address Translation) được sử dụng để chuyển đổi giữa IP private và IP public.\n\nÝ nghĩa của địa chỉ private: được sử dụng để bảo tồn địa chỉ IP public đang dần cạn kiệt.\n\n\n### 5. Chia subnet:\n\n*Subnet mask là một dải 32 bit nhị phân đi kèm với một địa chỉ IP, được các host sử dụng để xác định địa chỉ mạng của địa chỉ IP này. Để làm được điều đó, host sẽ đem địa chỉ IP thực hiện phép tính AND từng bit một của địa chỉ với subnet mask của nó, kết quả host sẽ thu được địa chỉ mạng tương ứng của địa chỉ IP.*\n\n\n![](https://media-exp1.licdn.com/dms/image/C5612AQHh-7xJZ50JiQ/article-inline_image-shrink_1000_1488/0/1628756971546?e=1671062400&v=beta&t=OGYjKsjsmNrsMtTxOVlhWGrPaXNtf23ZCsThHD1Yg-U)\n\nĐối với chúng ta, quy tắc gợi nhớ subnet mask rất đơn giản: phần mạng chạy đến đâu, bit 1 của subnet mask chạy đến đó và ứng với các bit phần host, các bit của subnet mask được thiết lập giá trị 0. Một số subnet mask chuẩn:\n\nLớp A : 255.0.0.0\n\nLớp B: 255.255.0.0\n\nLớp C: 255.255.255.0\n\n\n- Gọi n là số bit mượn và m là số bit host còn lại. Ta có:\n\n    + Số subnet có thể chia được:\n\n2n            nếu có hỗ trợ subnet – zero.\n2n – 2  nếu không hỗ trợ subnet – zero.\nLuật subnet – zero: nếu hệ điều hành trên host không bật tính năng subnet – zero, khi chia subnet ta phải bỏ đi không dùng hai mạng con ứng với các bit subnet bằng 0 hết và các bit subnet bằng 1 hết. Ngược lại nếu hệ điều hành bật tính năng subnet – zero , ta có quyền sử dụng hai mạng con này. Nhìn chung, các hệ điều hành ngày nay đều bật tính năng subnet – zero một cách mặc định, do đó nếu không thấy nói gì thêm trong yêu cầu, ta sử dụng cách chia có hỗ trợ subnet – zero.\n\n   + Số host có thể có trên mỗi subnet: 2m – 2 (host/subnet).\n\n-  Với mỗi subnet chia được:\n\n+ Địa chỉ mạng có octet bị mượn là bội số của bước nhảy. Bước nhảy tương ứng với số bit mượn có thể được tra trong bảng 1.2 của mục 1.\n\n+ Địa chỉ host đầu = địa chỉ mạng + 1 (cần hiểu cộng 1 ở đây là lùi về sau một địa chỉ).\n\n+ Địa chỉ broadcast = địa chỉ mạng kế tiếp – 1 (cần hiểu trừ 1 ở đây là lùi về phía trước một địa chỉ).\n\n+ Địa chỉ host cuối = địa chỉ broadcast – 1 (cần hiểu trừ 1 ở đây là lùi về phía trước một địa chỉ).\n\n-   Để tính ra subnet mask được sử dụng, ta sử dụng cách nhớ: phần mạng của địa chỉ chạy đến đâu, các bit 1 của subnet mask chạy đến đó và bảng 1.1 của mục 1.1.\n``\nVí dụ\n192.168.1.64/26   -> địa chỉ mạng\n\n           192.168.1.65/26   ->địa chỉ host đầu\n\n                       …..\n\n           192.168.1.126/26  ->địa chỉ host cuối\n\n           192.168.1.127/26  ->địa chỉ broadcast.\n\n\nTài liệu tham khảo [tại đây](https://www.linkedin.com/pulse/ch%C6%B0%C6%A1ng-1-%C4%91%E1%BB%8Ba-ch%E1%BB%89-ip-chia-subnet-vlsm-summary-viet-professional#:~:text=%2D%20%C4%90%E1%BB%8Ba%20ch%E1%BB%89%20l%E1%BB%9Bp%20C%20s%E1%BB%AD,.0.0%20%2D%3E%20223.255.255.0) nhẫn để xem thêm",
        "PhoToCreater": "https://lh3.googleusercontent.com/a/ALm5wu3tHto7Wj006cGiGqeDUyRBbumR04XWe_fqypKpRA=s96-c",
        "createrID": "117140301807267739210",
        "view": true,
        "makeCode": "RXAMCY",
        "path": "DIACHIIP,CHIASUBNETRXAMCY117140301807267739210",
        "createdBy": "Tran Van Thinh B1906773",
        "date": "18102022",
        "title": "ĐỊA CHỈ IP, CHIA SUBNET"
    }
]